fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого Элемент Из Объект.ОтпускаСотрудников Цикл
		Дней = ((НачалоДня(Элемент.ДатаОкончания) - НачалоДня(Элемент.ДатаНачала)) / 86400) + 1;
		
		Если Дней > 0 Тогда
			Элемент.КоличествоДней = Дней;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	Объект.Год = НачалоГода(Объект.Год);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковСотрудникПриИзменении(Элемент)
	ПриИзмененииДаты();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ПриИзмененииДаты();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ПриИзмененииДаты();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресДанныхВХранилище = ПоместитьДанныеДокументаВХранилище();
	ПараметрыПодбора = Новый Структура("АдресДанныхДокумента", АдресДанныхВХранилище);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыПодбора, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииДаты()

	ДанныеСтроки = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Дней = ((НачалоДня(ДанныеСтроки.ДатаОкончания) - НачалоДня(ДанныеСтроки.ДатаНачала)) / 86400) + 1;
	Если Дней > 0 Тогда
		ДанныеСтроки.КоличествоДней = Дней;
	КонецЕсли;
		

КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеДокументаВХранилище()
	ДанныеДокумента = Новый Структура("Год", Объект.Год);
	ДанныеДокумента.Вставить("ОтпускаСотрудников", Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, ДатаНачала, ДатаОкончания"));
	Возврат ПоместитьВоВременноеХранилище(ДанныеДокумента, УникальныйИдентификатор);
КонецФункции

#КонецОбласти
